boat_race_sites = {
    "桐　生": {
        "id": "01",
        "lat": 36.394941,
        "lon": 139.311189,
        "direction": "南南東",  # 進行方向
        "angle": 157.5          # 方角を角度に変換（後述）
    },
    "戸　田": {
        "id": "02",
        "lat": 35.803590,
        "lon": 139.660078,
        "direction": "東南東",
        "angle": 112.5
    },
    "江戸川": {
        "id": "03",
        "lat": 35.693736,
        "lon": 139.860778,
        "direction": "北北東",
        "angle": 22.5
    },
    "平和島": {
        "id": "04",
        "lat": 35.587305,
        "lon": 139.738378,
        "direction": "真　北",
        "angle": 0.0
    },
    "多摩川": {
        "id": "05",
        "lat": 35.657157,
        "lon": 139.494932,
        "direction": "真　西",
        "angle": 270.0
    },
    "浜名湖": {
        "id": "06",
        "lat": 34.696915,
        "lon": 137.572994,
        "direction": "真　南",
        "angle": 180.0
    },
    "蒲　郡": {
        "id": "07",
        "lat": 34.822389,
        "lon": 137.204654,
        "direction": "南　西",
        "angle": 225.0
    },
    "常　滑": {
        "id": "08",
        "lat": 34.884821,
        "lon": 136.831737,
        "direction": "真　西",
        "angle": 270.0
    },
    "津": {
        "id": "09",
        "lat": 34.681203,
        "lon": 136.520419,
        "direction": "西北西",
        "angle": 292.5
    },
    "三　国": {
        "id": "10",
        "lat": 36.231986,
        "lon": 136.187102,
        "direction": "南南東",
        "angle": 157.5
    },
    "びわこ": {
        "id": "11",
        "lat": 35.017141,
        "lon": 135.62033,
        "direction": "真　南",
        "angle": 180.0
    },
    "住之江": {
        "id": "12",
        "lat": 34.610105,
        "lon": 135.472001,
        "direction": "南南西",
        "angle": 202.5
    },
    "尼　崎": {
        "id": "13",
        "lat": 34.718028,
        "lon": 135.392164,
        "direction": "西南西",
        "angle": 247.5
    },
    "鳴　門": {
        "id": "14",
        "lat": 34.191254,
        "lon": 134.610844,
        "direction": "東南東",
        "angle": 112.5
    },
    "丸　亀": {
        "id": "15",
        "lat": 34.305349,
        "lon": 133.793256,
        "direction": "真　北",
        "angle": 0.0
    },
    "児　島": {
        "id": "16",
        "lat": 34.446990,
        "lon": 133.810324,
        "direction": "真　南",
        "angle": 180.0
    },
    "宮　島": {
        "id": "17",
        "lat": 34.446990,
        "lon": 132.305957,
        "direction": "南南東",
        "angle": 157.5
    },
    "徳　山": {
        "id": "18",
        "lat": 34.010717,
        "lon": 131.832824,
        "direction": "北　西",
        "angle": 315.0
    },
    "下　関": {
        "id": "19",
        "lat": 34.017588,
        "lon": 131.003960,
        "direction": "南　西",
        "angle": 225.0
    },
    "若　松": {
        "id": "20",
        "lat": 33.885930,
        "lon": 130.664972,
        "direction": "西南西",
        "angle": 247.5
    },
    "芦　屋": {
        "id": "21",
        "lat": 33.874833,
        "lon": 130.664972,
        "direction": "真　東",
        "angle": 90.0
    },
    "福　岡": {
        "id": "22",
        "lat": 33.600682,
        "lon": 130.398077,
        "direction": "北　東",
        "angle": 45.0
    },
    "唐　津": {
        "id": "23",
        "lat": 33.422857,
        "lon": 129.996056,
        "direction": "南南西",
        "angle": 202.5
    },
    "大　村": {
        "id": "24",
        "lat": 32.898435,
        "lon": 129.952065,
        "direction": "北　東",
        "angle": 45.0
    },

}